<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current Adobe Reader pkg and repackages, replacing a problematic preinstall script, 
and enabling installation on non-boot volumes. Setting MAJOR_VERSION to "10" will cause a download of the 
latest/last version of Adobe Reader 10, but the repackager is unlikely to operate properly with that version.
</string>
    <key>Identifier</key>
    <string>com.github.Ubertec.pkg.AdobeReader</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeReader</string>
        <key>LANGUAGE</key>
        <string>English</string>
        <key>MAJOR_VERSION</key>
        <string>11</string>
        <key>OS_VERSION</key>
        <string>10.8.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.Ubertec.download.AdobeReader</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AdobeReaderRepackager</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
