<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Monitoring Client then imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.Ubertec.munki.UbertecMonitoringClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Monitoring Client</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>monitoring</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>The Ubertec Monitoring Client facilitates the monitoring and reporting of any client characteristics within an Organization</string>
            <key>developer</key>
            <string>Ubertec Ltd</string>
            <key>display_name</key>
            <string>Ubertec Monitoring Client</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>supported_architectures</key>
            <array>
                <string>x86_64</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.Ubertec.download.UbertecMonitoringClient</string>
    <key>Process</key>
    <array>
                <dict>
                    <key>Processor</key>
                    <string>Unarchiver</string>
                    <key>Arguments</key>
                        <dict>
                            <key>archive_path</key>
                            <string>%pathname%</string>
                            <key>destination_path</key>
                            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                            <key>purge_destination</key>
                            <true/>
                        </dict>
                                <dict>
                                <key>Processor</key>
                                <string>PkgExtractor</string>
                                <key>Arguments</key>
                                    <dict>
                                    <key>pkg_path</key>
                                    <string>%pathname%</string>
                                    <key>extract_root</key>
                                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                                    </dict>
                                </dict>
                                        <dict>
                                        <key>Processor</key>
                                        <string>DmgCreator</string>
                                        <key>Arguments</key>
                                            <dict>
                                            <key>dmg_root</key>
                                            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                                            <key>dmg_path</key>
                                            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                                            </dict>
                                        </dict>
                        <dict>
                        <key>Processor</key>
                        <string>MunkiImporter</string>
                        </dict>
                </dict>        
    </array>
</dict>
</plist>
