<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest Office 2011 update, downloads the disk image and extracts the pkg.
Set VERSION to a specific version number to download that version instead.
Set CULTURE_CODE to a different value to get a different localization. See
http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.

`autopkg run MSOffice2011Updates.munki -k VERSION=14.1.0` will download and import the
14.1.0 update; most of the later Office updates declare they require this update, so save
yourself some headaches by adding this update to your repo even if you don't technically
require it because your base installer is 14.1.0 or higher.
</string>
    <key>Identifier</key>
    <string>com.github.Ubertec.munki.Office2011Updates</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Office2011_update</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Office2011</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
              <string>MSN Messenger</string>
              <string>Microsoft Lync</string>
              <string>Microsoft Cert Manager</string>
              <string>Microsoft Chart Converter</string>
              <string>Microsoft Clip Gallery</string>
              <string>Microsoft Entourage</string>
              <string>Microsoft Outlook</string>
              <string>Microsoft Error Reporting</string>
              <string>Microsoft Excel</string>
              <string>Microsoft Graph</string>
              <string>Microsoft Help Viewer</string>
              <string>Microsoft Language Register</string>
              <string>Microsoft Communicator</string>
              <string>Microsoft Messenger</string>
              <string>Microsoft PowerPoint</string>
              <string>Microsoft Query</string>
              <string>Microsoft Word</string>
              <string>My Day</string>
              <string>Organization Chart</string>
              <string>Expression Media</string>
              <string>Remote Desktop Connection</string>
              <string>Opera</string>
              <string>Google Chrome</string>
              <string>Firefox</string>
              <string>Safari</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>update_for</key>
            <array>
                <string>Office2011</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.Ubertec.download.Office2011Updates</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Merge input pkginfo and additional_pkginfo generated by MSOffice2011UpdateInfoProvider</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
