<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Jing and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.Ubertec.munki.Jing</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>Jing</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Jing For Mac</string>
            <key>display_name</key>
            <string>Jing</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.Ubertec.download.Jing</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>Unarchiver</string>
          <key>Arguments</key>
          <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>archive_format</key>
            <string>zip</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>purge_destination</key>
            <true/>
          </dict>
        </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>dmg_root</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
            <key>dmg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
          </dict>
          <key>Processor</key>
          <string>DmgCreator</string>
        </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
