<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest drivers for the Wacom Intuos Pro tablets.</string>
	<key>Identifier</key>
	<string>com.github.Ubertec.download.WacomIntuosProTabletDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WacomIntuosProDriver</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
	    <dict>
	        <key>Processor</key>
	        <string>URLTextSearcher</string>
	        <key>Arguments</key>
	        <dict>
	            <key>url</key>
	            <string>http://us.wacom.com/en/support/drivers</string>
	            <key>re_pattern</key>
                <string>(?P&lt;url&gt;https?://.*\.?wacom\.com/.*/drivers?/mac/pro[^/]*/WacomTablet_(?P&lt;version&gt;[\w\d\.-]+)\.dmg)</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
	        </dict>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
