<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest NVIDIA CUDA driver for Mac from the NVDIA web site.</string>
	<key>Identifier</key>
	<string>com.github.Ubertec.download.CudaDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NvidiaCudaDriver</string>
        <key>download_page_url</key>
        <string>http://www.nvidia.com/object/cuda-mac-driver.html</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_page_url%</string>
                <key>re_pattern</key>
                <string>"(?P&lt;url&gt;https?://.*\.nvidia\.com/Mac/.+/cudadriver-(?P&lt;version&gt;[\d\.]+)-macos\.dmg)"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
